gett/gett_ui/spec/fixtures/gett/receipt_response.json

{
  "ride_id": "8064989",
  "charges": [
    {
      "name": "Fare",
      "description": null,
      "amount": 53.04,
      "type": "base_fare"
    },
    {
      "name": "Free Waiting Time",
      "description": "00:03:00",
      "amount": 0,
      "type": "free_waiting_time"
    },
    {
      "name": "Paid Waiting Time",
      "description": "01:29:13",
      "amount": 14.5,
      "type": "paid_waiting_time"
    },
    {
      "name": "Stops",
      "description": "+1.24 mi",
      "amount": 6.1,
      "type": "stops"
    },
    {
      "name": "Additional Fee",
      "description": null,
      "amount": 10,
      "type": "additional_fee"
    },
    {
      "name": "extra3",
      "description": "X1",
      "amount": 10,
      "type": "extra"
    },
    {
      "name": "extra2",
      "description": "X1",
      "amount": 2,
      "type": "extra"
    },
    {
      "name": "extra1",
      "description": "X5",
      "amount": 25,
      "type": "extra"
    },
    {
      "name": "Tip",
      "description": "10.0%",
      "amount": "5.3",
      "type": "tip"
    },
    {
      "name": "Sub Total",
      "description": null,
      "amount": 120.64,
      "type": "subtotal"
    },
    {
      "name": "Booking fee",
      "description": null,
      "amount": 1.5,
      "type": "commission"
    },
    {
      "name": "Handling fee",
      "description": "20.0%",
      "amount": 10.61,
      "type": "commission"
    },
    {
      "name": "Sales Tax",
      "description": "20.0%",
      "amount": 26.55,
      "type": "tax"
    },
    {
      "name": "Black Car Tax",
      "description": "2.0%",
      "amount": 2.41,
      "type": "tax"
    },
    {
      "name": "Total",
      "description": null,
      "amount": 161.71,
      "type": "total"
    }
  ],
  "currency_code": "GBP",
  "duration": "00:19:56",
  "distance": 14.3606,
  "distance_label": "miles"
}
